package resources;

import java.util.ListResourceBundle;

public class Resources_ru extends ListResourceBundle {

    private static Object[][] contents = {
            {"Ошибка отправки команды на сервер!", "Ошибка отправки команды на сервер!"},
            {"Неправильно введен ключ!", "Неправильно введен ключ!"},
            {"Неопознанная команда. Наберите 'help' для получения справки по доступным командам.", "Неопознанная команда. Наберите 'help' для получения справки по доступным командам."},
            {"Отсутствует аргумент.", "Отсутствует аргумент."},
            {"Введите данные до конца!", "Введите данные до конца!"},
            {"Неправильный формат площади!", "Неправильный формат площади!"},
            {"Неправильный формат количества комнат!", "Неправильный формат количества комнат!"},
            {"Неправильный формат координаты x!", "Неправильный формат координаты x!"},
            {"Неправильный формат координаты y!", "Неправильный формат координаты y!"},
            {"Неправильно задано качество обстановки!", "Неправильно задано качество обстановки!"},
            {"Неправильно задано поле зрения!", "Неправильно задано поле зрения!"},
            {"Неправильно задан вид транспорта!", "Неправильно задан вид транспорта!"},
            {"Неправильный формат возраста дома!", "Неправильный формат возраста дома!"},
            {"Неправильный формат количества квартир на этаже!", "Неправильный формат количества квартир на этаже!"},
            {"Данные введены неверно!", "Данные введены неверно!"},
            {"Соединение с сервером установлено!", "Соединение с сервером установлено!"},
            {"Ошибка соединения с сервером!", "Ошибка соединения с сервером!"},
            {"Неправильный формат!", "Неправильный формат!"},
            {"Неверный формат аргумента!", "Неверный формат аргумента!"},
            {"Имя создателя: ", "Имя создателя: "},
            {"Имя: ", "Имя: "},
            {"Дата создания: ", "Дата создания: "},
            {"Координата X: ", "Координата X: "},
            {"Координата Y: ", "Координата Y: "},
            {"Площадь: ", "Площадь: "},
            {"Количество комнат: ", "Количество комнат: "},
            {"Качество обстановки: ", "Качество обстановки: "},
            {"Видимость: ", "Видимость: "},
            {"Транспорт: ", "Транспорт: "},
            {"Имя дома: ", "Имя дома: "},
            {"Возраст дома: ", "Возраст дома: "},
            {"Количество квартир: ", "Количество квартир: "},
            {"Введите логин и пароль!", "Введите логин и пароль!"},
            {"Соединение с сервером разорвано!", "Соединение с сервером разорвано!"},
            {"Выберите строку!", "Выберите строку!"},
            {"Соединение с сервером восстановлено!", "Соединение с сервером восстановлено!"},
            {"Введите данные о квартире:", "Введите данные о квартире:"},
            {"Имя:", "Имя:"},
            {"Площадь:", "Площадь:"},
            {"Количество комнат:", "Количество комнат:"},
            {"Координата X:", "Координата X:"},
            {"Координата Y:", "Координата Y:"},
            {"Качество обстановки:", "Качество обстановки:"},
            {"Поле зрения:", "Поле зрения:"},
            {"Вид транспорта:", "Вид транспорта:"},
            {"Имя дома:", "Имя дома:"},
            {"Возраст дома:", "Возраст дома:"},
            {"Количество квартир на этаже:", "Количество квартир на этаже:"},
            {"Назад", "Назад"},
            {"Таблица элементов коллекции:", "Таблица элементов коллекции:"},
            {"Удалить", "Удалить"},
            {"Изменить", "Изменить"},
            {"Обновить", "Обновить"},
            {"Фильтр", "Фильтр"},
            {"Консольные команды", "Консольные команды"},
            {"Таблица", "Таблица"},
            {"Визуализация", "Визуализация"},
            {"Введите порт", "Введите порт"},
            {"Авторизация", "Авторизация"},
            {"Вход", "Вход"},
            {"Регистрация", "Регистрация"}
    };

    @Override
    protected Object[][] getContents() {
        return contents;
    }
}
